ws-asahi/UkiUkiCore/megaavr/variants/UkiUkiduinoProMicro/pins_arduino.h
/* pins_arduino.h - Variant definition for the UkiUkiduino ProMicro (AVR64DU32)
 * ---------------------------------------------------------------------------
 * Part of UkiUkiCore (a product-specific fork of WazamonoCore / SpenceKonde's
 * DxCore; the pin map follows the UkiUkiduino ProMicro variant).
 * DxCore is (C) Spence Konde 2021-2022, open source (LGPL 2.1, see LICENSE.md),
 * based on existing Arduino cores. This variant (C) Workshop Asahi 2026.
 *
 * Board   : UkiUkiduino ProMicro (Pro Micro form factor, AVR64DU32, USB-C;
 *           official fan goods of the VTuber Yuniko Ukiuki). Derived from the
 *           Wazamono Tachi rev.5 layout with the UkiUkiduino on-board user
 *           button and full-color LED added, and the regulator removed
 *           (the board is 5 V-only: RAW and VCC are both wired to +5V).
 * MCU     : AVR64DU32  (32-pin TQFP)
 * Clock   : internal OSCHF, 24 MHz fixed (no crystal on the board; boards.txt
 *           pins build.clocksource=0). USB CLK_USB (48 MHz) is produced by
 *           OSCHF + PLL48M and auto-tuned to the USB SOF.
 *           PA0/PA1 (the XTALHF pads) carry the TX/RX activity LEDs.
 *
 *  ===== Pin numbering: Pro Micro compatible (NONCANONICAL) =====
 *  (source: UkiUkiduinoProMicro.net + UkiUkiduinoProMicro_ProMicro互換用ピン構成.csv)
 *   D#   MCU   Pro Micro role / notes                          A#,  AIN
 *   D0   PA5   RX  (Serial1 = USART0 RX, ALT1)                 A11, AIN25
 *   D1   PA4   TX  (Serial1 = USART0 TX, ALT1)                 A12, AIN24
 *   D2   PA2   SDA (I2C)                                       A13, AIN22
 *   D3   PA3   SCL (I2C) | ~PWM(TCB1 WO, default outlet)       A14, AIN23
 *   D4   PC3   ~PWM(TCB1 via LUT1-OUT) | LUT1-OUT              A6,  AIN31
 *   D5   PD0   ~PWM(TCA0 WO0) | LUT2-IN0                       A15, AIN0
 *   D6   PD1   ~PWM(TCA0 WO1) | LUT2-IN1                       A7,  AIN1
 *   D7   PA6   ~PWM(TCB1 via LUT0-OUT alt) | USART0 XCK        A16, AIN26
 *   D8   PA7   USART0 XDIR | AC0 OUT | EVOUTA | CLKOUT         A8,  AIN27
 *   D9   PD2   ~PWM(TCA0 WO2) | LUT2-IN2 | AINP0 | EVOUTD      A9,  AIN2
 *   D10  PD3   ~PWM(TCA0 WO3) | LUT2-OUT | AINN0               A10, AIN3
 *   D11..D13   (do not exist - gap, like the 32U4 Pro Micro)
 *   D14  PD5   MISO | ~PWM(TCA0 WO5)                           A17, AIN5
 *   D15  PD6   SCK  | Serial2 TX (USART1 ALT2)                 A18, AIN6
 *   D16  PD4   MOSI | ~PWM(TCA0 WO4)                           A19, AIN4
 *   D17  PF5   LED_BUILTIN - state pin of the on-board WS2812B full-color
 *              LED (see LED below; no header, no ADC alias)
 *   D18  PD7   A0 | SPI SS | Serial2 RX (USART1 ALT2) | VREFA       AIN7
 *   D19  PF1   A1 | LUT3-IN1                                        AIN17
 *   D20  PF2   A2 | LUT3-IN2 | EVOUTF                               AIN18
 *   D21  PF3   A3 | LUT3-OUT                                        AIN19
 *   D22  PF0   BTN_BUILTIN (on-board button, 5.1 kOhm pull-down,
 *              pressed = HIGH; no header) | LUT3-IN0                AIN16
 *        PF4   WS2812B LED data-in (index 23; driven by the D17 software
 *              mirror - not a user pin, no Dn alias)
 *   D24..D29   (do not exist - gap)
 *   D30  PA0   TX LED = LED_BUILTIN_TX (on-board, active-LOW, no header)
 *   D31  PA1   RX LED = LED_BUILTIN_RX (on-board, active-LOW, no header)
 *   --- not exposed as a numbered Dn (appended so the arrays are complete) ---
 *        PF6   RESET                                   index 32
 *        PF7   UPDI                                    index 33  (== PIN_PF7, highest)
 *
 *  ===== Peripheral routing (set by this variant + boards.txt) =====
 *   TCA0  -> PORTD (WO0..WO5 = PD0..PD5 = D5/D6/D9/D10/D16/D14) : TCA0_PINS below
 *            -> classic Pro Micro PWM set D3/D5/D6/D9/D10 is fully reproduced;
 *               D14/D16 gain bonus PWM (mutually exclusive with SPI use).
 *   TCB1  -> ONE waveform, THREE exclusive outlets (WAZAMONO_TCB1_PWMMUX):
 *            D3 = PA3 (TCB1 WO, default PORTMUX position, outlet = CCMPEN),
 *            D7 = PA6 (LUT0-OUT alternate position),
 *            D4 = PC3 (LUT1-OUT default position).
 *            The last analogWrite() among the three owns the route (default D3).
 *   millis-> TCB0  : boards.txt passes -DMILLIS_USE_TIMERB0 so TCB1 is free for D3/D4/D7 PWM
 *   tone()-> TCB1  : shares TCB1 with D3/D4/D7 PWM (tone() suspends them; TCA0 PWM keeps running)
 *   SPI0  -> ALT4 (PD4/PD5/PD6/PD7 = D16/D14/D15/D18), the ONLY position offered:
 *            the DEFAULT position (PA4..PA7) is occupied by USART0/Serial1.
 *            Board is SPI host; chip-selects are user GPIO (auto-SS not used).
 *            SPI client mode (SPISlave library) uses PD7 = A0 as SS.
 *   TWI0  -> default (PA2 SDA / PA3 SCL) = D2/D3, the Pro Micro I2C position.
 *   USART0-> Serial1, ALT1 (PA4 TX / PA5 RX / PA6 XCK / PA7 XDIR) = D1/D0/D7/D8.
 *   USART1-> Serial2, ALT2 (PD6 TX / PD7 RX) = D15/D18. Shares pins with SPI
 *            SCK/SS, so Serial2 and SPI are mutually exclusive.
 *   CCL   -> LUT0: OUT = D7 (alt; IN0/IN1 = PA0/PA1 are the TX/RX LEDs);
 *            LUT1: OUT = D4 (IN0..IN2 = PC0..PC2 do not exist on the 32-pin part);
 *            LUT2: IN0/IN1/IN2 = D5/D6/D9, OUT = D10, alt OUT = D15;
 *            LUT3: IN0 = D22 (BTN_BUILTIN), IN1/IN2 = A1/A2, OUT = A3 (D21).
 *   AREF  -> PD7 (VREFA) doubles as analog input A0 (D18). The Pro Micro has
 *            no AREF header; an external reference would have to be fed into
 *            the A0 pin and costs A0 / SPI SS / Serial2 RX.
 *   LED   -> the user LED is an XL-5050RGBC-WS2812B addressable RGB LED whose
 *            DIN is wired to PF4. LED_BUILTIN is D17 = PF5, an otherwise
 *            unused MCU pin (no header) that acts as the LED's STATE pin:
 *            digitalWrite()/digitalWriteFast() to D17 are SOFTWARE-mirrored -
 *            the core reads the resulting PF5 OUT bit and sends the matching
 *            WS2812 frame on PF4 (HIGH = lit in the current color, yellow by
 *            default; LOW = off). Because PF5 is a real pin, digitalRead(D17)
 *            returns the LED state, so "digitalWrite(LED_BUILTIN,
 *            !digitalRead(LED_BUILTIN))" toggles as expected (the data line
 *            itself must idle LOW for the WS2812 latch, so it cannot carry the
 *            state). Same mechanism and same setBLEDColor() API as the Uno
 *            UkiUkiduino; only the pins differ. Each mirrored write costs
 *            ~330 us (300 us latch guard + 24 us frame).
 *            TX/RX activity LEDs: PA0 (D30) / PA1 (D31), active-LOW (anode to
 *            +5V via 1 kOhm), driven from the USB-CDC hooks
 *            (ukiukiduinopromicro_init.cpp), Pro Micro convention.
 *   BUTTON-> BTN_BUILTIN = D22 (PF0). 5.1 kOhm pull-down on the board;
 *            pressed = HIGH. Use pinMode(BTN_BUILTIN, INPUT) - no pullup needed.
 *   Serial-> native USB CDC (USBSerial), Leonardo/Micro convention.
 *
 *   NOTE on names: "Serial" is the native USB CDC (serial monitor). The D0/D1
 *   hardware UART is "Serial1" (Pro Micro / Uno R4 convention; alias of the
 *   core's Serial0 object), and USART1 is exposed as "Serial2".
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

/* Board identification: ARDUINO_AVR_UKIUKIDUINO_PROMICRO is THE macro that
 * identifies this board (boards.txt build.board=AVR_UKIUKIDUINO_PROMICRO ->
 * -DARDUINO_AVR_UKIUKIDUINO_PROMICRO); the fallback below covers builds
 * outside the IDE. UKIUKIDUINO_PINOUT is shared with the Uno-form UkiUkiduino
 * and marks "a board with the UkiUkiduino LED/button feature set";
 * UKIUKIDUINO_PROMICRO_PINOUT selects the ProMicro-specific implementation
 * files (ukiukiduinopromicro_init.cpp / ukiukiduinopromicro_led.cpp).
 * MCU identification comes from the compiler (-mmcu): __AVR_AVR64DU32__. */
#ifndef ARDUINO_AVR_UKIUKIDUINO_PROMICRO
  #define ARDUINO_AVR_UKIUKIDUINO_PROMICRO 1
#endif
#define DU_32PIN_PINOUT
#define UKIUKIDUINO_PINOUT            /* UkiUkiduino family (LED_BUILTIN mirror + setBLEDColor + BTN_BUILTIN) */
#define UKIUKIDUINO_PROMICRO_PINOUT   /* this board's variant sources */
#define NONCANONICAL_PIN_NUMBERS

/* ---- User-facing serial names (core support in UART0.cpp / UART1.cpp /
 * HardwareSerial.h): Serial1 -> USART0 (D0/D1), Serial2 -> USART1 (D15/D18). */
#ifndef WAZAMONO_SERIAL1_IS_USART0
  #define WAZAMONO_SERIAL1_IS_USART0
#endif
#ifndef WAZAMONO_SERIAL2_IS_USART1
  #define WAZAMONO_SERIAL2_IS_USART1
#endif

/* ---- Digital pin number for each MCU pin (Pro Micro layout) ---- */
#define PIN_PA5 (0)   // D0  RX  (Serial1 = USART0 RX)
#define PIN_PA4 (1)   // D1  TX  (Serial1 = USART0 TX)
#define PIN_PA2 (2)   // D2  SDA
#define PIN_PA3 (3)   // D3  SCL / TCB1 PWM (WO, default outlet)
#define PIN_PC3 (4)   // D4  TCB1 PWM via LUT1-OUT
#define PIN_PD0 (5)   // D5  TCA0 WO0
#define PIN_PD1 (6)   // D6  TCA0 WO1
#define PIN_PA6 (7)   // D7  TCB1 PWM via LUT0-OUT (alt) / USART0 XCK
#define PIN_PA7 (8)   // D8  USART0 XDIR / AC0 OUT / EVOUTA / CLKOUT
#define PIN_PD2 (9)   // D9  TCA0 WO2 / AINP0 / EVOUTD
#define PIN_PD3 (10)  // D10 TCA0 WO3 / AINN0
//  no  D11..D13              (gap)
#define PIN_PD5 (14)  // D14 MISO / TCA0 WO5
#define PIN_PD6 (15)  // D15 SCK / Serial2 TX
#define PIN_PD4 (16)  // D16 MOSI / TCA0 WO4
#define PIN_PF5 (17)  // D17 LED_BUILTIN state pin (mirrored to the WS2812B on PF4; no header)
#define PIN_PD7 (18)  // D18 A0 / SPI SS / Serial2 RX / VREFA
#define PIN_PF1 (19)  // D19 A1 / LUT3-IN1
#define PIN_PF2 (20)  // D20 A2 / LUT3-IN2 / EVOUTF
#define PIN_PF3 (21)  // D21 A3 / LUT3-OUT
#define PIN_PF0 (22)  // D22 BTN_BUILTIN (on-board button, 5.1k pull-down, pressed = HIGH) / LUT3-IN0
#define PIN_PF4 (23)  // WS2812B LED data-in (driven by the D17 software mirror); no Dn alias
//  no  D24..D29              (gap)
#define PIN_PA0 (30)  // D30 TX LED = LED_BUILTIN_TX (active-LOW, on-board only)
#define PIN_PA1 (31)  // D31 RX LED = LED_BUILTIN_RX (active-LOW, on-board only)
#define PIN_PF6 (32)  // RESET
#define PIN_PF7 (33)  // UPDI  (highest index -> sets NUM_DIGITAL_PINS = 34)

/* ---- Counts ---- */
#define PINS_COUNT                     (34)  // length of the pin tables (incl. gaps/reserved)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 34
// NUM_INTERNALLY_USED_PINS           -> auto = 0 (crystal-less: no reserved GPIO)

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PF5)   // D17, on-board full-color LED (WS2812B mirror; Active-HIGH)
#endif
#if !defined(BTN_BUILTIN)
  #define BTN_BUILTIN                  (PIN_PF0)   // D22, on-board button (pull-down, pressed = HIGH)
#endif
#define LED_BUILTIN_TX                 (PIN_PA0)   // D30 = USB-CDC TX activity LED (active-LOW)
#define LED_BUILTIN_RX                 (PIN_PA1)   // D31 = USB-CDC RX activity LED (active-LOW)

/* 32U4 Leonardo / Pro Micro activity-LED helper macros, same semantics:
 * xxLED1 = ON, xxLED0 = OFF (both LEDs are active-LOW on this board too;
 * TX = PA0/D30, RX = PA1/D31). OUT is set HIGH (= off) before DIR so the
 * LEDs cannot flash on. The core's own CDC activity one-shot
 * (ukiukiduinopromicro_init.cpp) drives the same pins. */
#define TX_RX_LED_INIT                 (PORTA.OUTSET = (PIN0_bm | PIN1_bm), \
                                        PORTA.DIRSET = (PIN0_bm | PIN1_bm))
#define TXLED1                         (PORTA.OUTCLR = PIN0_bm)   /* TX LED (PA0/D30) ON  */
#define TXLED0                         (PORTA.OUTSET = PIN0_bm)   /* TX LED (PA0/D30) OFF */
#define RXLED1                         (PORTA.OUTCLR = PIN1_bm)   /* RX LED (PA1/D31) ON  */
#define RXLED0                         (PORTA.OUTSET = PIN1_bm)   /* RX LED (PA1/D31) OFF */

/* ---- LED_BUILTIN software mirror (see wiring_digital.c) ----
 * digitalWrite()/digitalWriteFast() on D17 (PF5) also call the hook below,
 * which reads the RESULTING PF5 OUT bit (so HIGH/LOW/CHANGE all mirror
 * correctly) and sends the matching WS2812 frame on PF4: HIGH = lit in the
 * current color (default: yellow), LOW = off. Implemented in
 * ukiukiduinopromicro_led.cpp. Direct register writes are NOT mirrored.
 * TIMING: each mirrored write busy-waits the WS2812 frame-latch time
 * (RES >= 80 us per the XL-5050RGBC-WS2812B datasheet; 300 us used) and then
 * streams the 24-bit frame with interrupts briefly disabled (~24 us).
 * digitalWrite(17) therefore takes ~330 us - fine for Blink-style use. */
#define LED_BUILTIN_MIRROR
#define LED_MIRROR_SRC_PIN             (PIN_PF5)   /* D17 */

#ifdef __cplusplus
extern "C" void __led_builtin_mirror_hook(void);
#else
void __led_builtin_mirror_hook(void);
#endif

#ifdef __cplusplus
/* ---- On-board LED color API (XL-5050RGBC-WS2812B on PF4) ----
 * Identical to the Uno-form UkiUkiduino: the LED follows LED_BUILTIN (D17),
 * digitalWrite(LED_BUILTIN, HIGH/LOW) = lit/off, and these functions change
 * WHAT "lit" looks like. The "B" in setBLEDColor marks them as Built-in-LED
 * functions:
 *
 *   setBLEDColor(Yellow);            named color (see LEDColorName) at the
 *                                    default brightness (40)
 *   setBLEDColor(Yellow, 255);       named color + brightness 0-255
 *   setBLEDColor(r, g, b);           raw 8-bit RGB components, shown as-is
 *                                    (no brightness scaling)
 *
 * If the LED is currently lit (D17 OUT is HIGH) the change is applied
 * immediately; otherwise it takes effect at the next digitalWrite(17, HIGH).
 * Power-on default: Yellow at brightness 40. */
enum LEDColorName : uint8_t {
  Red, Green, Blue, Yellow, Orange, Cyan, Magenta, Purple, Pink, White
};
#define BLED_DEFAULT_BRIGHTNESS 40
void setBLEDColor(uint8_t r, uint8_t g, uint8_t b);
void setBLEDColor(LEDColorName color, uint8_t brightness = BLED_DEFAULT_BRIGHTNESS);
#endif

/* ---- Event output pins: FIXED by the board's pin-configuration table ----
 *   EVOUTA -> PA7 = D8   (PORTMUX ALT1;    default PA2 is SDA)
 *   EVOUTD -> PD2 = D9   (PORTMUX default; the alternative PD7 is A0)
 *   EVOUTF -> PF2 = D20  (PORTMUX default) = A2 */
#define WAZAMONO_EVOUTA_PIN            (PIN_PA7)
#define WAZAMONO_EVOUTA_ALT            (1)
#define WAZAMONO_EVOUTD_PIN            (PIN_PD2)
#define WAZAMONO_EVOUTD_ALT            (0)
#define WAZAMONO_EVOUTF_PIN            (PIN_PF2)
#define WAZAMONO_EVOUTF_ALT            (0)

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

/* ---- Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used) ----
 * PA0/PA1 (the TX/RX LEDs) have no ADC channel on the DU. PF4/PF5 (the
 * WS2812 data / state pins) do have channels (AIN20/AIN21) but are internal
 * to the LED and deliberately not mapped. */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PD0 ?  0 : (p) == PIN_PD1 ?  1 : (p) == PIN_PD2 ?  2 : (p) == PIN_PD3 ?  3 : \
    (p) == PIN_PD4 ?  4 : (p) == PIN_PD5 ?  5 : (p) == PIN_PD6 ?  6 : (p) == PIN_PD7 ?  7 : \
    (p) == PIN_PF0 ? 16 : (p) == PIN_PF1 ? 17 : (p) == PIN_PF2 ? 18 : (p) == PIN_PF3 ? 19 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA4 ? 24 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA6 ? 26 : (p) == PIN_PA7 ? 27 : (p) == PIN_PC3 ? 31 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) ==  0 ? PIN_PD0 : (p) ==  1 ? PIN_PD1 : (p) ==  2 ? PIN_PD2 : (p) ==  3 ? PIN_PD3 : \
    (p) ==  4 ? PIN_PD4 : (p) ==  5 ? PIN_PD5 : (p) ==  6 ? PIN_PD6 : (p) ==  7 ? PIN_PD7 : \
    (p) == 16 ? PIN_PF0 : (p) == 17 ? PIN_PF1 : (p) == 18 ? PIN_PF2 : (p) == 19 ? PIN_PF3 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 24 ? PIN_PA4 : (p) == 25 ? PIN_PA5 : \
    (p) == 26 ? PIN_PA6 : (p) == 27 ? PIN_PA7 : (p) == 31 ? PIN_PC3 : NOT_A_PIN )

