ws-asahi/UkiUkiCore/megaavr/variants/UkiUkiduinoProMicro/pins_arduino.h
#define analogInputToDigitalPin(p)        analogChannelToDigitalPin((p) & 0x7F)
#define digitalOrAnalogPinToDigital(p)    (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p) <= NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN))
#define portToPinZero(port)               ((port) == PA ? PIN_PA0 : ((port) == PC ? PIN_PC3 : ((port) == PD ? PIN_PD0 : ((port) == PF ? PIN_PF0 : NOT_A_PIN))))

/* ---- PWM ----
 * millis lives on TCB0 (boards.txt -DMILLIS_USE_TIMERB0), leaving TCB1 free for
 * PWM and for tone(). ONE TCB1 waveform, THREE exclusive outlets
 * (WAZAMONO_TCB1_PWMMUX, core mechanism in cores/dxcore/wazamono_lutpwm.{h,c}):
 *   D3 = PA3  TCB1's own WO pin (default PORTMUX position, outlet = CCMPEN)
 *   D7 = PA6  LUT0-OUT, alternate position (CCLROUTEA LUT0 = 1)
 *   D4 = PC3  LUT1-OUT, default position
 * The last analogWrite() among the three owns the route (default D3); the
 * other two return to plain GPIO. All three share TCB1's frequency and duty.
 * tone() uses TCB1 (millis on TCB0), so tone() suspends D3/D4/D7 PWM.
 * NOTE: TCB1 stays on its DEFAULT WO position (PA3). Its ALT1 position is
 * PF5 = D17 = LED_BUILTIN state pin, so it must never be parked there. */
#if defined(MILLIS_USE_TIMERB1)
  #define digitalPinHasPWMTCB(p) (0)                   /* TCB1 is millis; no TCB PWM */
#else
  #define digitalPinHasPWMTCB(p) ((p) == PIN_PA3 || (p) == PIN_PA6 || (p) == PIN_PC3)
#endif
#define digitalPinHasPWMTCA(p) ( \
    (p) == PIN_PD0 || (p) == PIN_PD1 || (p) == PIN_PD2 || \
    (p) == PIN_PD3 || (p) == PIN_PD4 || (p) == PIN_PD5 )

/* TCA0 -> PORTD: WO0..WO5 = PD0..PD5 = D5/D6/D9/D10/D16/D14. Together with
 * TCB1 on D3 this reproduces the classic Pro Micro PWM pin set
 * (D3, D5, D6, D9, D10) exactly, plus bonus PWM on D4/D7 (TCB1 route) and
 * D14/D16 (SPI-exclusive). */
#define TCA0_PINS                       (PORTMUX_TCA0_PORTD_gc)
#define TCB0_PINS                       (0x00)   // TCB0 = millis; WO unused (default PA2 position)
#define TCB1_PINS                       (0x00)   // TCB1 WO on PA3 (default) = D3, the default outlet (ALT1 would be PF5 = LED state pin!)

#define PIN_TCA0_WO0_INIT               (PIN_PD0)
#define PIN_TCB0_WO_INIT                (PIN_PA2)   // TCB0 = millis; not enabled for PWM
#define PIN_TCB1_WO_INIT                (PIN_PA3)

#define WAZAMONO_TCB1_PWMMUX            (1)         /* exclusive D3/D4/D7 routing (default D3) */
#define WAZAMONO_TCB1_PWM_WO_PIN        (PIN_PA3)   /* D3: TCB1 WO itself (TCB1_PINS = default), outlet = CCMPEN */
#define WAZAMONO_TCB1_PWM_LUT0_PIN      (PIN_PA6)   /* D7: LUT0-OUT, alternate position */
#define WAZAMONO_TCB1_PWM_LUT0          (0)
#define WAZAMONO_TCB1_PWM_LUT0_ALT      (1)
#define WAZAMONO_TCB1_PWM_LUT1_PIN      (PIN_PC3)   /* D4: LUT1-OUT, default position */
#define WAZAMONO_TCB1_PWM_LUT1          (1)
#define WAZAMONO_TCB1_PWM_LUT1_ALT      (0)

#define digitalPinHasPWM(p)             (digitalPinHasPWMTCB(p) || digitalPinHasPWMTCA(p))

/* ---- SPI 0 (host; chip-selects are user GPIO). ALT4 (PD4..PD7) is the ONLY
 * position on this board: the DEFAULT position (PA4..PA7) belongs to
 * USART0/Serial1. (USART0's MSPI host mode on D0/D1/D7 is the informal "SPI1"
 * of the pin table; it is driven through the USART, not this library.) ---- */
#define SPI_INTERFACES_COUNT            (1)
#define SPI_MUX                         (PORTMUX_SPI0_ALT4_gc)
#define SPI_MUX_PINSWAP_4               (PORTMUX_SPI0_ALT4_gc)
#define SPI_MUX_PINSWAP_NONE            (PORTMUX_SPI0_NONE_gc)
#define PIN_SPI_MOSI                    (PIN_PD4)   // D16
#define PIN_SPI_MISO                    (PIN_PD5)   // D14
#define PIN_SPI_SCK                     (PIN_PD6)   // D15
#define PIN_SPI_SS                      (PIN_PD7)   // D18 = A0 (hardware SS; host mode -> user GPIO)
#define PIN_SPI_SS_HARDWARE             (PIN_PD7)   // the ALT4 SS pin itself (client mode / SPISlave; exclusive with A0 / Serial2 RX)
#define PIN_SPI_MOSI_PINSWAP_4          (PIN_PD4)
#define PIN_SPI_MISO_PINSWAP_4          (PIN_PD5)
#define PIN_SPI_SCK_PINSWAP_4           (PIN_PD6)
#define PIN_SPI_SS_PINSWAP_4            (PIN_PD7)

/* ---- TWI 0 (I2C on D2/D3, Pro Micro convention) ---- */
#define PIN_WIRE_SDA                    (PIN_PA2)   // D2
#define PIN_WIRE_SCL                    (PIN_PA3)   // D3
#define PIN_WIRE_SDA_PINSWAP_1          (NOT_A_PIN)
#define PIN_WIRE_SCL_PINSWAP_1          (NOT_A_PIN)
#define PIN_WIRE_SDA_PINSWAP_3          (NOT_A_PIN) // ALT3 = PA0/PA1 = the on-board TX/RX LEDs: not offered
#define PIN_WIRE_SCL_PINSWAP_3          (NOT_A_PIN)

/* ---- USART0 -> user-facing "Serial1", default position ALT1
 * (PA4 TX / PA5 RX / PA6 XCK / PA7 XDIR = D1/D0/D7/D8): the full-function
 * position, enabling USART-SPI-host mode and RS-485 XDIR on header pins. ---- */
#define HWSERIAL0_MUX                   (0x00 /* PORTMUX_USART0_DEFAULT_gc - PA0/PA1 = TX/RX LEDs */)
#define HWSERIAL0_MUX_PINSWAP_1         (0x01 /* PORTMUX_USART0_ALT1_gc - PA4..PA7 */)
#define HWSERIAL0_MUX_PINSWAP_2         (0x02 /* PORTMUX_USART0_ALT2_gc - PA2/PA3 (= I2C) */)
#define HWSERIAL0_MUX_PINSWAP_3         (0x03 /* PORTMUX_USART0_ALT3_gc - PD4..PD7 (= SPI/A0) */)
#define HWSERIAL0_MUX_PINSWAP_NONE      (0x05)
#define HWSERIAL0_MUX_DEFAULT          (1)   /* default: USART0 ALT1 (PA4/PA5). DEFAULT (PA0/PA1) = TX/RX LEDs: not offered. */
#define PIN_HWSERIAL0_TX                (NOT_A_PIN) /* DEFAULT = PA0 (TX LED, no header) */
#define PIN_HWSERIAL0_RX                (NOT_A_PIN) /* DEFAULT = PA1 (RX LED, no header) */
#define PIN_HWSERIAL0_XCK               (PIN_PA2)
#define PIN_HWSERIAL0_XDIR              (PIN_PA3)
#define PIN_HWSERIAL0_TX_PINSWAP_1      (PIN_PA4)
#define PIN_HWSERIAL0_RX_PINSWAP_1      (PIN_PA5)
#define PIN_HWSERIAL0_XCK_PINSWAP_1     (PIN_PA6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_1    (PIN_PA7)
#define PIN_HWSERIAL0_TX_PINSWAP_2      (PIN_PA2)
#define PIN_HWSERIAL0_RX_PINSWAP_2      (PIN_PA3)
#define PIN_HWSERIAL0_XCK_PINSWAP_2     (NOT_A_PIN)
#define PIN_HWSERIAL0_XDIR_PINSWAP_2    (NOT_A_PIN)
#define PIN_HWSERIAL0_TX_PINSWAP_3      (PIN_PD4)
#define PIN_HWSERIAL0_RX_PINSWAP_3      (PIN_PD5)
#define PIN_HWSERIAL0_XCK_PINSWAP_3     (PIN_PD6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_3    (PIN_PD7)

