ws-asahi/UkiUkiCore/megaavr/variants/UkiUkiduinoProMicro/pins_arduino.h
/* ---- USART1 -> user-facing "Serial2", only usable position is ALT2
 * (PD6 TX / PD7 RX = D15 / D18=A0). Shares pins with SPI SCK/SS. ---- */
#define HWSERIAL1_MUX                   (0x00 /* PORTMUX_USART1_DEFAULT_gc - no pins */)
#define HWSERIAL1_MUX_PINSWAP_1         (0x01 << 3 /* ALT1 absent on DU - placeholder */)
#define HWSERIAL1_MUX_PINSWAP_2         (0x02 << 3 /* PORTMUX_USART1_ALT2_gc - PD6 TX / PD7 RX */)
#define HWSERIAL1_MUX_PINSWAP_NONE      (0x03 << 3)
#define HWSERIAL1_MUX_DEFAULT          (2)   /* USART1 fixed on ALT2 (PD6/PD7 = D15/D18) */
#define PIN_HWSERIAL1_TX                (NOT_A_PIN)
#define PIN_HWSERIAL1_RX                (NOT_A_PIN)
#define PIN_HWSERIAL1_XCK               (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR              (NOT_A_PIN)
#define PIN_HWSERIAL1_TX_PINSWAP_1      (NOT_A_PIN)
#define PIN_HWSERIAL1_RX_PINSWAP_1      (NOT_A_PIN)
#define PIN_HWSERIAL1_XCK_PINSWAP_1     (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR_PINSWAP_1    (NOT_A_PIN)
#define PIN_HWSERIAL1_TX_PINSWAP_2      (PIN_PD6)   /* D15 */
#define PIN_HWSERIAL1_RX_PINSWAP_2      (PIN_PD7)   /* D18 / A0 */
#define PIN_HWSERIAL1_XCK_PINSWAP_2     (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR_PINSWAP_2    (NOT_A_PIN)

/* ---- Arduino analog aliases (per the board pin-configuration table).
 * A0..A3 = D18..D21 match the Pro Micro header. There is NO A4/A5 (the Pro
 * Micro has no such pins; on this board PF4/PF5 belong to the LED). The
 * remaining ADC-capable header pins are reachable as A6..A19, each carrying
 * its own D-number's channel (A6=D4, A7=D6, A8=D8, A9=D9, A10=D10, A11=D0,
 * A12=D1, A13=D2, A14=D3, A15=D5, A16=D7, A17=D14, A18=D15, A19=D16). ---- */
#define PIN_A0   (PIN_PD7)   // D18 (also SPI SS / Serial2 RX / VREFA)
#define PIN_A1   (PIN_PF1)   // D19
#define PIN_A2   (PIN_PF2)   // D20
#define PIN_A3   (PIN_PF3)   // D21
#define PIN_A6   (PIN_PC3)   // D4
#define PIN_A7   (PIN_PD1)   // D6
#define PIN_A8   (PIN_PA7)   // D8
#define PIN_A9   (PIN_PD2)   // D9
#define PIN_A10  (PIN_PD3)   // D10
#define PIN_A11  (PIN_PA5)   // D0
#define PIN_A12  (PIN_PA4)   // D1
#define PIN_A13  (PIN_PA2)   // D2
#define PIN_A14  (PIN_PA3)   // D3
#define PIN_A15  (PIN_PD0)   // D5
#define PIN_A16  (PIN_PA6)   // D7
#define PIN_A17  (PIN_PD5)   // D14
#define PIN_A18  (PIN_PD6)   // D15
#define PIN_A19  (PIN_PD4)   // D16

/* --- Uno R4 style number-prefixed digital pin aliases ---
 * D-number == Arduino digital pin number. Internal-only pins (PF4 LED data,
 * PF6 RESET, PF7 UPDI) are intentionally NOT exposed as Dn. The on-board
 * LED_BUILTIN (D17), button (D22) and TX/RX LEDs (D30/D31) ARE exposed. */
#undef D0
#undef D1
#undef D2
#undef D3
#undef D4
#undef D5
#undef D6
#undef D7
#undef D8
#undef D9
#undef D10
#undef D14
#undef D15
#undef D16
#undef D17
#undef D18
#undef D19
#undef D20
#undef D21
#undef D22
#undef D30
#undef D31
static const uint8_t D0  = PIN_PA5;  // RX (Serial1)
static const uint8_t D1  = PIN_PA4;  // TX (Serial1)
static const uint8_t D2  = PIN_PA2;  // SDA
static const uint8_t D3  = PIN_PA3;  // SCL / ~PWM(TCB1 WO, default outlet)
static const uint8_t D4  = PIN_PC3;  // ~PWM(TCB1 via LUT1)
static const uint8_t D5  = PIN_PD0;  // ~PWM
static const uint8_t D6  = PIN_PD1;  // ~PWM
static const uint8_t D7  = PIN_PA6;  // ~PWM(TCB1 via LUT0 alt) / USART0 XCK
static const uint8_t D8  = PIN_PA7;  // USART0 XDIR / AC0 OUT / EVOUTA / CLKOUT
static const uint8_t D9  = PIN_PD2;  // ~PWM
static const uint8_t D10 = PIN_PD3;  // ~PWM
static const uint8_t D14 = PIN_PD5;  // MISO / ~PWM
static const uint8_t D15 = PIN_PD6;  // SCK / Serial2 TX
static const uint8_t D16 = PIN_PD4;  // MOSI / ~PWM
static const uint8_t D17 = PIN_PF5;  // LED_BUILTIN (full-color LED state pin, on-board only)
static const uint8_t D18 = PIN_PD7;  // A0 / SPI SS / Serial2 RX
static const uint8_t D19 = PIN_PF1;  // A1
static const uint8_t D20 = PIN_PF2;  // A2 / EVOUTF
static const uint8_t D21 = PIN_PF3;  // A3 / LUT3-OUT
static const uint8_t D22 = PIN_PF0;  // BTN_BUILTIN (on-board button, pressed = HIGH)
static const uint8_t D30 = PIN_PA0;  // TX LED = LED_BUILTIN_TX (active-LOW, on-board only)
static const uint8_t D31 = PIN_PA1;  // RX LED = LED_BUILTIN_RX (active-LOW, on-board only)

static const uint8_t A0   = PIN_A0;
static const uint8_t A1   = PIN_A1;
static const uint8_t A2   = PIN_A2;
static const uint8_t A3   = PIN_A3;
static const uint8_t A6   = PIN_A6;
static const uint8_t A7   = PIN_A7;
static const uint8_t A8   = PIN_A8;
static const uint8_t A9   = PIN_A9;
static const uint8_t A10  = PIN_A10;
static const uint8_t A11  = PIN_A11;
static const uint8_t A12  = PIN_A12;
static const uint8_t A13  = PIN_A13;
static const uint8_t A14  = PIN_A14;
static const uint8_t A15  = PIN_A15;
static const uint8_t A16  = PIN_A16;
static const uint8_t A17  = PIN_A17;
static const uint8_t A18  = PIN_A18;
static const uint8_t A19  = PIN_A19;

/* Direct ADC channel identifiers (ADC_CH() sets the 0x80 "this is a channel" flag). */
#define AIN0   ADC_CH(0)
#define AIN1   ADC_CH(1)
#define AIN2   ADC_CH(2)
#define AIN3   ADC_CH(3)
#define AIN4   ADC_CH(4)
#define AIN5   ADC_CH(5)
#define AIN6   ADC_CH(6)
#define AIN7   ADC_CH(7)
#define AIN16  ADC_CH(16)
#define AIN17  ADC_CH(17)
#define AIN18  ADC_CH(18)
#define AIN19  ADC_CH(19)
#define AIN20  ADC_CH(20)
#define AIN21  ADC_CH(21)
#define AIN22  ADC_CH(22)
#define AIN23  ADC_CH(23)
#define AIN24  ADC_CH(24)
#define AIN25  ADC_CH(25)
#define AIN26  ADC_CH(26)
#define AIN27  ADC_CH(27)
#define AIN31  ADC_CH(31)

/* ---- Pin arrays (ARDUINO_MAIN). Indexed by digital pin number (0..33). Gaps are NOT_A_PORT. ---- */
#ifdef ARDUINO_MAIN
  const uint8_t digital_pin_to_port[] = {
    PA,         //  0 PA5  D0 RX (Serial1)
    PA,         //  1 PA4  D1 TX (Serial1)
    PA,         //  2 PA2  D2 SDA  (TCB0 WO - TCB0 is millis on this board)
    PA,         //  3 PA3  D3 SCL  (TCB1 WO - default PWM outlet, exclusive with D4/D7)
    PC,         //  4 PC3  D4      (TCB1 PWM via CCL LUT1 - exclusive with D3/D7)
    PD,         //  5 PD0  D5  (TCA0 WO0, dynamic)
    PD,         //  6 PD1  D6  (TCA0 WO1, dynamic)
    PA,         //  7 PA6  D7 XCK  (TCB1 PWM via CCL LUT0 alt - exclusive with D3/D4)
    PA,         //  8 PA7  D8 XDIR/AC0/EVOUTA
    PD,         //  9 PD2  D9  (TCA0 WO2, dynamic)
    PD,         // 10 PD3  D10 (TCA0 WO3, dynamic)
    NOT_A_PORT, // 11 (gap)
    NOT_A_PORT, // 12 (gap)
    NOT_A_PORT, // 13 (gap)
    PD,         // 14 PD5  D14 MISO (TCA0 WO5, dynamic)
    PD,         // 15 PD6  D15 SCK/Serial2 TX
    PD,         // 16 PD4  D16 MOSI (TCA0 WO4, dynamic)
    PF,         // 17 PF5  D17 LED_BUILTIN (state pin, mirrored to WS2812B on PF4)
    PD,         // 18 PD7  D18 A0/SS/Serial2 RX
    PF,         // 19 PF1  D19 A1
    PF,         // 20 PF2  D20 A2/EVOUTF
    PF,         // 21 PF3  D21 A3/LUT3-OUT
    PF,         // 22 PF0  D22 BTN_BUILTIN
    PF,         // 23 PF4  WS2812B LED data-in
    NOT_A_PORT, // 24 (gap)
    NOT_A_PORT, // 25 (gap)
    NOT_A_PORT, // 26 (gap)
    NOT_A_PORT, // 27 (gap)
    NOT_A_PORT, // 28 (gap)
    NOT_A_PORT, // 29 (gap)
    PA,         // 30 PA0  D30 TX LED
    PA,         // 31 PA1  D31 RX LED
    PF,         // 32 PF6  RESET
    PF          // 33 PF7  UPDI
  };

