ws-asahi/UkiUkiCore/megaavr/variants/UkiUkiduinoProMicro/pins_arduino.h
  const uint8_t digital_pin_to_bit_position[] = {
    PIN5_bp,   //  0 PA5  D0
    PIN4_bp,   //  1 PA4  D1
    PIN2_bp,   //  2 PA2  D2
    PIN3_bp,   //  3 PA3  D3
    PIN3_bp,   //  4 PC3  D4
    PIN0_bp,   //  5 PD0  D5
    PIN1_bp,   //  6 PD1  D6
    PIN6_bp,   //  7 PA6  D7
    PIN7_bp,   //  8 PA7  D8
    PIN2_bp,   //  9 PD2  D9
    PIN3_bp,   // 10 PD3  D10
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    NOT_A_PIN, // 13 (gap)
    PIN5_bp,   // 14 PD5  D14
    PIN6_bp,   // 15 PD6  D15
    PIN4_bp,   // 16 PD4  D16
    PIN5_bp,   // 17 PF5  D17 LED_BUILTIN
    PIN7_bp,   // 18 PD7  D18
    PIN1_bp,   // 19 PF1  D19
    PIN2_bp,   // 20 PF2  D20
    PIN3_bp,   // 21 PF3  D21
    PIN0_bp,   // 22 PF0  D22 BTN_BUILTIN
    PIN4_bp,   // 23 PF4  WS2812B data
    NOT_A_PIN, // 24 (gap)
    NOT_A_PIN, // 25 (gap)
    NOT_A_PIN, // 26 (gap)
    NOT_A_PIN, // 27 (gap)
    NOT_A_PIN, // 28 (gap)
    NOT_A_PIN, // 29 (gap)
    PIN0_bp,   // 30 PA0  D30 TX LED
    PIN1_bp,   // 31 PA1  D31 RX LED
    PIN6_bp,   // 32 PF6  RESET
    PIN7_bp    // 33 PF7  UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = {
    PIN5_bm,   //  0 PA5  D0
    PIN4_bm,   //  1 PA4  D1
    PIN2_bm,   //  2 PA2  D2
    PIN3_bm,   //  3 PA3  D3
    PIN3_bm,   //  4 PC3  D4
    PIN0_bm,   //  5 PD0  D5
    PIN1_bm,   //  6 PD1  D6
    PIN6_bm,   //  7 PA6  D7
    PIN7_bm,   //  8 PA7  D8
    PIN2_bm,   //  9 PD2  D9
    PIN3_bm,   // 10 PD3  D10
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    NOT_A_PIN, // 13 (gap)
    PIN5_bm,   // 14 PD5  D14
    PIN6_bm,   // 15 PD6  D15
    PIN4_bm,   // 16 PD4  D16
    PIN5_bm,   // 17 PF5  D17 LED_BUILTIN
    PIN7_bm,   // 18 PD7  D18
    PIN1_bm,   // 19 PF1  D19
    PIN2_bm,   // 20 PF2  D20
    PIN3_bm,   // 21 PF3  D21
    PIN0_bm,   // 22 PF0  D22 BTN_BUILTIN
    PIN4_bm,   // 23 PF4  WS2812B data
    NOT_A_PIN, // 24 (gap)
    NOT_A_PIN, // 25 (gap)
    NOT_A_PIN, // 26 (gap)
    NOT_A_PIN, // 27 (gap)
    NOT_A_PIN, // 28 (gap)
    NOT_A_PIN, // 29 (gap)
    PIN0_bm,   // 30 PA0  D30 TX LED
    PIN1_bm,   // 31 PA1  D31 RX LED
    PIN6_bm,   // 32 PF6  RESET
    PIN7_bm    // 33 PF7  UPDI
  };

  /* TCA0 PWM is resolved dynamically from PORTMUX, so TCA0 pins are NOT_ON_TIMER
   * here. TIMERB1 is set on all three TCB1 outlets (D3 = WO, D4 = LUT1-OUT,
   * D7 = LUT0-OUT alt): the core's TCB analogWrite() path then asks the
   * WAZAMONO_TCB1_PWMMUX hook (wazamono_lutpwm.c) to open the right outlet. */
  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA5  D0
    NOT_ON_TIMER, //  1 PA4  D1
    TIMERB0,      //  2 PA2  D2 SDA  (TCB0 WO - TCB0 is millis on this board)
    TIMERB1,      //  3 PA3  D3 SCL  (TCB1 WO - default PWM outlet)
    TIMERB1,      //  4 PC3  D4      (TCB1 PWM via CCL LUT1)
    NOT_ON_TIMER, //  5 PD0  D5  (TCA0 WO0, dynamic)
    NOT_ON_TIMER, //  6 PD1  D6  (TCA0 WO1, dynamic)
    TIMERB1,      //  7 PA6  D7      (TCB1 PWM via CCL LUT0 alt)
    NOT_ON_TIMER, //  8 PA7  D8
    NOT_ON_TIMER, //  9 PD2  D9  (TCA0 WO2, dynamic)
    NOT_ON_TIMER, // 10 PD3  D10 (TCA0 WO3, dynamic)
    NOT_ON_TIMER, // 11 (gap)
    NOT_ON_TIMER, // 12 (gap)
    NOT_ON_TIMER, // 13 (gap)
    NOT_ON_TIMER, // 14 PD5  D14 (TCA0 WO5, dynamic)
    NOT_ON_TIMER, // 15 PD6  D15
    NOT_ON_TIMER, // 16 PD4  D16 (TCA0 WO4, dynamic)
    NOT_ON_TIMER, // 17 PF5  D17 LED_BUILTIN
    NOT_ON_TIMER, // 18 PD7  D18
    NOT_ON_TIMER, // 19 PF1  D19
    NOT_ON_TIMER, // 20 PF2  D20
    NOT_ON_TIMER, // 21 PF3  D21
    NOT_ON_TIMER, // 22 PF0  D22 BTN_BUILTIN
    NOT_ON_TIMER, // 23 PF4  WS2812B data
    NOT_ON_TIMER, // 24 (gap)
    NOT_ON_TIMER, // 25 (gap)
    NOT_ON_TIMER, // 26 (gap)
    NOT_ON_TIMER, // 27 (gap)
    NOT_ON_TIMER, // 28 (gap)
    NOT_ON_TIMER, // 29 (gap)
    NOT_ON_TIMER, // 30 PA0  D30 TX LED
    NOT_ON_TIMER, // 31 PA1  D31 RX LED
    NOT_ON_TIMER, // 32 PF6  RESET
    NOT_ON_TIMER  // 33 PF7  UPDI
  };
#endif

/* =================================================================
 *  USB identity   (AVR DU = USB-native part, treated like the 32U4)
 * =================================================================
 *  USBCON enables Arduino's HID / Keyboard / Mouse / etc. on this board.
 *  NOTE: the native USB-CDC descriptor's VID/PID/product string are taken
 *  from cores/dxcore/usb_descriptors.{h,c} (selected there by the
 *  ARDUINO_AVR_UKIUKIDUINO_PROMICRO macro), so the values below are
 *  informational only - keep them in sync.
 *  Effective app identity: 0x1209:0x000E, product "UkiUkiduino ProMicro".
 *  These are pid.codes TEST-range placeholders; obtain a real product
 *  VID/PID before release.
 */
#ifndef USBCON
  #define USBCON
#endif
#ifndef USB_VID
  #define USB_VID                0x1209
#endif
#ifndef USB_PID
  #define USB_PID                0x000E
#endif
#ifndef USB_MANUFACTURER
  #define USB_MANUFACTURER       "Workshop Asahi"
#endif
#ifndef USB_PRODUCT
  #define USB_PRODUCT            "UkiUkiduino ProMicro"
#endif

/* =================================================================
 *  Serial -> native USB CDC   (Leonardo/Micro convention)
 * =================================================================
 *  Serial  = USBSerial (on-chip USB CDC)              <- primary / USB serial monitor
 *  Serial1 = USART0   (D0/D1, ALT1 - the Pro Micro hardware UART; alias of the
 *                      core's Serial0 object)
 *  Serial2 = USART1   (D15 TX / D18 RX, ALT2 - extra UART; shares pins with SPI
 *                      SCK/SS, so Serial2 and SPI are mutually exclusive)
 *  Define HAVE_NO_USB_SERIAL_REDIRECT (from boards.txt) to keep Serial==USART0.
 */
#if defined(USB0) && !defined(HAVE_NO_USB_SERIAL_REDIRECT)
  #ifndef Serial
    #define Serial                  USBSerial   /* Serial = native USB CDC   */
  #endif
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR     Serial
  #endif
  #ifndef SERIAL_PORT_USBVIRTUAL
    #define SERIAL_PORT_USBVIRTUAL  Serial
  #endif
  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE    Serial1     /* Pro Micro hardware UART on D0/D1 */
  #endif
  /* Pro Micro / Leonardo define SERIAL_PORT_HARDWARE_OPEN = Serial1. */
  #ifndef SERIAL_PORT_HARDWARE_OPEN
    #define SERIAL_PORT_HARDWARE_OPEN  Serial1
  #endif
  /* 32U4-core alias used by Caterina-era and SAMD-portable sketches. */
  #ifndef SerialUSB
    #define SerialUSB               SERIAL_PORT_USBVIRTUAL
  #endif
#endif

#endif
